app/views/admin/accounts/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---

    <h1>Accounts of <%= @accounts.first.user.name %></h1>