app/controllers/admin/accounts_controller.rb

  def update
    respond_to do |format|
      if @account.update(account_param)
---
UPDATE "accounts" SET "name" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["name", "SBI branch2"], ["updated_at", "2023-01-03 10:28:38.832292"], ["id", 28]]

  def destroy
    @account.destroy
---
DELETE FROM "accounts" WHERE "accounts"."id" = ?  [["id", 29]]

  def set_user
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

  def set_account
    @account = Account.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]