app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]
---
    <h2><%= @article.body %></h2>
    <%= @article.comments.each do |comment| %>