app/views/users/create_form.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---

<%= form.collection_select :user,User.order(:name),:id,:name %>