app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties"
---
  def index
    @properties = Property.all

INSERT INTO "properties" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["price", nil], ["created_at", "2022-12-30 12:28:50.380566"], ["updated_at", "2022-12-30 12:28:50.380566"]]
---
  def create
    @property = Property.new(property_params)

    respond_to do |format|
      if @property.save

DELETE FROM "properties" WHERE "properties"."id" = ?  [["id", 1]]
---
  def destroy
    @property.destroy

SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_property
    @property = Property.find(params[:id])