app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
   @users=User.includes(:acc)
   @user_list=User.all

INSERT INTO "users" ("name", "age", "gender", "created_at", "updated_at", "accounts_count") VALUES (?, ?, ?, ?, ?, ?)  [["name", "gg"], ["age", 21], ["gender", nil], ["created_at", "2023-01-02 05:22:32.261062"], ["updated_at", "2023-01-02 05:22:32.261062"], ["accounts_count", 0]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "age" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["age", 23], ["updated_at", "2023-01-02 11:02:32.170688"], ["id", 58]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def create_form
    @user=User.first

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def set_user
    id = params[:id].presence || params[:user_id]
    @user = User.find(id)